#[path = "_1_简介.rs"]
mod _1_简介;
#[path = "_2_rust的内存安全意味着什么第1部分.rs"]
mod _2_rust的内存安全意味着什么第1部分;

#[path = "_4_创建_构建和运行rust程序.rs"]
mod _4_创建_构建和运行rust程序;

#[path = "_5_rust中的打印相关宏.rs"]
mod _5_rust中的打印相关宏;

#[path = "_12_字符串的r和r标记.rs"]
mod _12_字符串的r和r标记;
#[path = "_6_format格式化和命名占位符.rs"]
mod _6_format格式化和命名占位符;
#[path = "_7_练习1.rs"]
mod _7_练习1;
#[path = "_8_实用的cargo工具.rs"]
mod _8_实用的cargo工具;
#[path = "_9_十六进制和二进制格式打印.rs"]
mod _9_十六进制和二进制格式打印;

#[path = "_13_变量可变性与数据类型详解.rs"]
mod _13_变量可变性与数据类型详解;
#[path = "_14_as关键字与ascii值存储.rs"]
mod _14_as关键字与ascii值存储;
#[path = "_15_字符数据类型.rs"]
mod _15_字符数据类型;
#[path = "_17_数组与数组遍历.rs"]
mod _17_数组与数组遍历;

#[path = "_19_算术运算符与简写语法.rs"]
mod _19_算术运算符与简写语法;
#[path = "_20_在Rust中编写函数.rs"]
mod _20_在Rust中编写函数;

#[path = "_21_rust的内存安全意味着什么第2部分.rs"]
mod _21_rust的内存安全意味着什么第2部分;

#[path = "_22_rust的内存安全意味着什么第3部分.rs"]
mod _22_rust的内存安全意味着什么第3部分;

#[path = "_23_单元测试.rs"]
mod _23_单元测试;
#[path = "_24_编写测试用例.rs"]
mod _24_编写测试用例;

#[path = "_25_标准库断言宏.rs"]
mod _25_标准库断言宏;

#[path = "_26_继续编写测试用例.rs"]
mod _26_继续编写测试用例;

#[path = "_28_引用.rs"]
mod _28_引用;

#[path = "_29_借用_借用者与被借用者.rs"]
mod _29_借用_借用者与被借用者;

#[path = "_30_切片数据类型.rs"]
mod _30_切片数据类型;

#[path = "_31_切片数据类型的标准库函数.rs"]
mod _31_切片数据类型的标准库函数;
#[path = "_32_将if_else用作语句和表达式.rs"]
mod _32_将if_else用作语句和表达式;

#[path = "_32_将if_else用作语句和表达式.rs"]
mod _33_match语句;

#[allow(dead_code)]
fn main() {
    if false {
        _1_简介::main();
        _2_rust的内存安全意味着什么第1部分::main();
        _4_创建_构建和运行rust程序::main();
        _5_rust中的打印相关宏::main();
        _6_format格式化和命名占位符::main();
        _7_练习1::main();
        _8_实用的cargo工具::main();
        _9_十六进制和二进制格式打印::main();
        _12_字符串的r和r标记::main();
        _13_变量可变性与数据类型详解::main();
        _14_as关键字与ascii值存储::main();
        _15_字符数据类型::main();
        _17_数组与数组遍历::main();
        _19_算术运算符与简写语法::main();
        _20_在Rust中编写函数::main();
        _21_rust的内存安全意味着什么第2部分::main();
        _22_rust的内存安全意味着什么第3部分::main();
        _23_单元测试::main();
        _24_编写测试用例::main();
        _25_标准库断言宏::main();
        _26_继续编写测试用例::main();
        _28_引用::main();
        _29_借用_借用者与被借用者::main();
        _30_切片数据类型::main();
        _31_切片数据类型的标准库函数::main();
        _32_将if_else用作语句和表达式::main();
    }

    
    _33_match语句::main();
}
